Revit 2027 API
ParameterTypeId.FloorParamIsStructural Property
 "Structural"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FloorParamIsStructural { get; }
Public Shared ReadOnly Property FloorParamIsStructural As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FloorParamIsStructural {
	ForgeTypeId^ get ();
}
static member FloorParamIsStructural : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace